#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 10808                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: lsw2207 <boj.kr/u/lsw2207>                  +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/10808                          #+#        #+#      #+#     #
#    Solved: 2025/09/03 23:17:33 by lsw2207       ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #

'''
    -  N = 100
    - 단어에 알파벳이 몇개씩 포함 되어 있는지
       
    - 우선 각 알파벳을 이용한 사전을 만든다 > M = 26
    - N을 돌면서 사전의 value를 증가해
'''

S = str(input())
alpha = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n'
         , 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z']
dict = {v: 0 for v in alpha}

for s in S:
    dict[s] += 1

print(*list(dict.values()))