#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 10773                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: lsw2207 <boj.kr/u/lsw2207>                  +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/10773                          #+#        #+#      #+#     #
#    Solved: 2025/09/10 13:13:58 by lsw2207       ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #

"""
    - 문제:
        - N = 100,000
        - 0이 나오면 가장 최근의 수를 지운다.
    - IDEA:
        - 0일 경우에는 스택의 pop을 함
"""

K = int(input())

stack = []
for _ in range(K):
    num = int(input())
    if num != 0:
        stack.append(num)
    else: # 0일 경우
        stack.pop()
    
print(sum(stack))