#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 10807                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: lsw2207 <boj.kr/u/lsw2207>                  +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/10807                          #+#        #+#      #+#     #
#    Solved: 2025/09/05 14:51:00 by lsw2207       ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #

"""
    - N에서 target 정수가 몇개인지 구해야함
    - N = 100 > 단순 반복문으로 구해도 가능
    - 또는? 카운트로 구함
"""

N = int(input())
numbers = list(map(int, input().split()))
target = int(input())

print(numbers.count(target))