#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 11328                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: lsw2207 <boj.kr/u/lsw2207>                  +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/11328                          #+#        #+#      #+#     #
#    Solved: 2025/09/05 15:42:47 by lsw2207       ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #

"""
- 문제:
    - T = 1000
    - N = 1000
    - 두 문자열이 같은지 확인한다
- idea:
    - 각 문자열의 알파벳 개수에 대해 딕셔너리를 만듦
    - 그리고 그 딕셔너리끼리 비교해
"""

T = int(input())

for tc in range(1, T+1):
    dict1 = {i: 0 for i in range(97, 97+27)}
    dict2 = {i: 0 for i in range(97, 97+27)}

    str1, str2 = input().split()

    for s in str1:
        dict1[ord(s)] += 1

    for s in str2:
        dict2[ord(s)] += 1
        
    """
        - 딕셔너리 비교 연산자:
            1. 키 집합이 같은지 비교함 > O(N)
            2. 각 키에 대해 값이 같은지 비교함 > O(N)
            > O(N)
    """
    if dict1 == dict2: 
        print('Possible')
    else:
        print("Impossible")